from src.function import BankWidget
import datetime
from config import operations_path

test_1 = BankWidget(operations_path)
test_1.read_file()
test_1.find_smallest()
test_1.selection_sort()
def test_read():
    assert test_1.read_file()[0] == {
                    "id": 441945886,
                    "state": "EXECUTED",
                    "date": datetime.datetime(2019, 8, 26, 10, 50, 58, 294041),
                    "operationAmount": {
                      "amount": "31957.58",
                      "currency": {
                        "name": "руб.",
                        "code": "RUB"
                      }
                    },
                    "description": "Перевод организации",
                    "from": "Maestro 1596837868705199",
                    "to": "Счет 64686473678894779589"
                  }

def test_last_five():

    assert test_1.last_operetions() == ('8.12.2019 - Открытие вклада\n'
 'кому - Счет ****************5907\n'
 '\n'
 '7.12.2019 - Перевод организации\n'
 'от - Visa 284287 ********** 9012\n'
 'кому - Счет ****************3655\n'
 '\n'
 '19.11.2019 - Перевод организации\n'
 'от -  781084 ********** 5568\n'
 'кому - Счет ****************2869\n'
 '\n'
 '13.11.2019 - Перевод со счета на счет\n'
 'от - Счет ****************9794\n'
 'кому - Счет ****************8125\n'
 '\n'
 '5.11.2019 - Открытие вклада\n'
 'кому - Счет ****************8381\n'
 '\n') != ('8.12.2019 - Открытие вклада\n'
 'кому - Счет ****************5907\n'
 '\n'
 '7.12.2019 - Перевод организации\n'
 'от - Visa 284287 ********** 9012\n'
 'кому - Счет ****************3655\n'
 '\n'
 '19.11.2019 - Перевод организации\n'
 'от -  781084 ********** 5568\n'
 'кому - Счет ****************2869\n'
 '\n'
 '13.11.2019 - Перевод со счета на счет\n'
 'от - Счет ****************9794\n'
 'кому - Счет ****************8125\n'
 '\n'
 '5.11.2019 - Открытие вклада\n'
 'кому - Счет ****************8381')
